## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.this["bluesky"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "did=did:plc:33zzvayo7qynpcba2varefbq"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_atproto.david"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "ecc59a79c63d0c89f8e64a5dfb41319a"
    }

  # cloudflare_record.this["david"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "davidzenisu.github.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "david"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ecc59a79c63d0c89f8e64a5dfb41319a"
    }

  # cloudflare_record.this["github"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "davidzenisu.github.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "github"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ecc59a79c63d0c89f8e64a5dfb41319a"
    }

  # cloudflare_record.this["grades"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "zealous-forest-0c694b103.3.azurestaticapps.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "grades"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ecc59a79c63d0c89f8e64a5dfb41319a"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>